src/Documents/инкПриемНаРаботу/инкПриемНаРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>инкПриемНаРаботу</name>
  <registerRecords>InformationRegister.инкПлановыеУдержания</registerRecords>
  <registerRecords>InformationRegister.инкПлановыеНачисления</registerRecords>
  <registerRecords>InformationRegister.инкКадроваяИсторияСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемаНаРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.инкДолжности</types>
    </type>
  </attributes>
  <attributes>
    <name>СевернаяНадбавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПлановыеНачисления</name>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.инкНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>РазмерНачисления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПлановыеУдержания</name>
    <attributes>
      <name>Удержание</name>
      <type>
        <types>ChartOfCalculationTypesRef.инкУдержания</types>
      </type>
    </attributes>
    <attributes>
      <name>РазмерУдержания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/инкКадроваяИсторияСотрудников/инкКадроваяИсторияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>инкКадроваяИсторияСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.инкДолжности</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.инкВидыКадровыхСобытий</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/инкПлановыеНачисления/инкПлановыеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>инкПлановыеНачисления</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РазмерНачисления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Начисление</name>
    <type>
      <types>ChartOfCalculationTypesRef.инкНачисления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/инкПлановыеУдержания/инкПлановыеУдержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>инкПлановыеУдержания</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РазмерУдержания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удержание</name>
    <type>
      <types>ChartOfCalculationTypesRef.инкУдержания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/инкВидыКадровыхСобытий/инкВидыКадровыхСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкВидыКадровыхСобытий</name>
  <enumValues>
    <name>Прием</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
  <enumValues>
    <name>НачальныеДанные</name>
  </enumValues>
  <enumValues>
    <name>ВосстановлениеВДолжности</name>
  </enumValues>
  <enumValues>
    <name>НеподтвержденныеДанные</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеОплатыТруда</name>
  </enumValues>
</mdclass:Enum>

src/Documents/инкПриемНаРаботу/ObjectModule.bsl
#Область о //Служебные процедуры и функции:

Процедура ОбработкаПроведения(Отказ, Режим)

	ЗаписьДвижений_инкКадроваяИсторияСотрудников();
	ЗаписьДвижений_инкПлановыеНачисления();
	ЗаписьДвижений_инкПлановыеУдержания();
			
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
    ОбновлениеИнформацииОСотруднике(РежимЗаписи);
    
КонецПроцедуры

#КонецОбласти	

#Область о //Дополнительные процедуры и функции:

Процедура ОбновлениеИнформацииОСотруднике(Режим)
    
    обСотрудник = ЭтотОбъект.Сотрудник.ПолучитьОбъект();
    
    Если Режим = РежимЗаписиДокумента.Проведение Тогда
                
        ЗаполнитьЗначенияСвойств(обСотрудник,ЭтотОбъект);
    
    ИначеЕсли Режим = РежимЗаписиДокумента.ОтменаПроведения Тогда
        
        обСотрудник.Организация = Неопределено;
    	обСотрудник.Подразделение = Неопределено; 
    	обСотрудник.Должность = Неопределено;
        обСотрудник.ДатаПриемаНаРаботу = Неопределено;
        
    	ЭтотОбъект.Оклад = 0;
    	ЭтотОбъект.РайонныйКоэффициент = 0;
    	ЭтотОбъект.СевернаяНадбавка = 0;

    КонецЕсли; 

	обСотрудник.Записать();
	
КонецПроцедуры
 
#КонецОбласти	

#Область о //Запись движений:

Процедура ЗаписьДвижений_инкКадроваяИсторияСотрудников()
	
	Движения.инкКадроваяИсторияСотрудников.Записывать = Истина;
	
	Движение = Движения.инкКадроваяИсторияСотрудников.Добавить();
	ЗаполнитьЗначенияСвойств(Движение,ЭтотОбъект);
	Движение.Период = НачалоДня(ДатаПриемаНаРаботу);
    Движение.ВидСобытия = Перечисления.инкВидыКадровыхСобытий.Прием;
	
КонецПроцедуры

Процедура ЗаписьДвижений_инкПлановыеНачисления();
	
	Движения.инкПлановыеНачисления.Записывать = Истина;
	
	Для каждого стрНачисления из ЭтотОбъект.ПлановыеНачисления Цикл
		
		Движение = Движения.инкПлановыеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение,ЭтотОбъект);
		ЗаполнитьЗначенияСвойств(Движение,стрНачисления);
		Движение.Период = НачалоДня(ДатаПриемаНаРаботу);
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаписьДвижений_инкПлановыеУдержания();
	
	Движения.инкПлановыеУдержания.Записывать = Истина;
	
	Для каждого стрУдержания из ЭтотОбъект.ПлановыеУдержания Цикл
		
		Движение = Движения.инкПлановыеУдержания.Добавить();
		ЗаполнитьЗначенияСвойств(Движение,ЭтотОбъект);
		ЗаполнитьЗначенияСвойств(Движение,стрУдержания);
		Движение.Период = НачалоДня(ДатаПриемаНаРаботу);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
